pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_start_symbol.h
//-----------------------------------------------------------------------------*
//                                                                             *
//                        File 'pic18_start_symbol.h'                          *
//                         Generated by version 2.5.8                          *
//                        may 23th, 2014, at 16h51'18"                         *
//                                                                             *
//-----------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_start_symbol_ENTITIES_DEFINED
#define pic18_start_symbol_ENTITIES_DEFINED

//-----------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//-----------------------------------------------------------------------------*

#include "piccolo_lexique.h"

//-----------------------------------------------------------------------------*

#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "pic18_semantics.h"
#include "piccolo_config.h"
#include "piccoloDevice_semantics.h"
#include "ram_sections.h"
#include "ipic18_build_block_representation.h"
#include "ipic18_optimize_block.h"
#include "ipic18_display_block_list.h"
#include "ipic18_block_representation.h"
#include "ipic18_regular_instructions.h"
#include "pic18_mnemonics.h"
#include "ipic18_terminators.h"
#include "intermediate_generic.h"
#include "ipic18_block_ordering.h"
#include "ipic18_cluster_ordering.h"
#include "ipic18_relatives_resolution.h"
#include "ipic18_code_generation.h"
#include "ipic18_stack_computations.h"
#include "pic18_used_routines.h"
#include "piccolo_embedded_devices.h"
#include "pic18_routine_inlining.h"

//-----------------------------------------------------------------------------*

class GALGAS__32_stringlist ;
class GALGAS__32_stringlist_2E_element ;
class GALGAS_FA_5F_instruction_5F_base_5F_code ;
class GALGAS_FA_5F_sequential_5F_instruction_5F_base_5F_code ;
class GALGAS_abstractBlockTerminationForBlockInstruction ;
class GALGAS_actualConfigurationMap ;
class GALGAS_actualConfigurationMap_2E_element ;
class GALGAS_application ;
class GALGAS_binaryset ;
class GALGAS_bitNumberExpression ;
class GALGAS_bitNumberLabelValue ;
class GALGAS_bitNumberLiteralValue ;
class GALGAS_bitSliceTable ;
class GALGAS_bitSliceTable_2E_element ;
class GALGAS_bit_5F_oriented_5F_op ;
class GALGAS_blockInitialBankSelectionMap ;
class GALGAS_blockInitialBankSelectionMap_2E_element ;
class GALGAS_blockInstructionBlockMap ;
class GALGAS_blockInstructionBlockMap_2E_element ;
class GALGAS_blockInvocationGraph ;
class GALGAS_blockMapForStackComputation ;
class GALGAS_blockMapForStackComputation_2E_element ;
class GALGAS_bool ;
class GALGAS_bootloaderReservedRAMmap ;
class GALGAS_bootloaderReservedRAMmap_2E_element ;
class GALGAS_branchOverflowMap ;
class GALGAS_branchOverflowMap_2E_element ;
class GALGAS_byteDeclarationInRam ;
class GALGAS_caseConstantMap ;
class GALGAS_caseConstantMap_2E_element ;
class GALGAS_char ;
class GALGAS_checkpicList ;
class GALGAS_checkpicList_2E_element ;
class GALGAS_clusterList ;
class GALGAS_clusterList_2E_element ;
class GALGAS_codeList ;
class GALGAS_codeList_2E_element ;
class GALGAS_conditionalBranchMode ;
class GALGAS_conditional_5F_branch ;
class GALGAS_configDefinitionList ;
class GALGAS_configDefinitionList_2E_element ;
class GALGAS_configFieldMap ;
class GALGAS_configFieldMap_2E_element ;
class GALGAS_configRegisterMap ;
class GALGAS_configRegisterMap_2E_element ;
class GALGAS_configRegisterMaskMap ;
class GALGAS_configRegisterMaskMap_2E_element ;
class GALGAS_configSettingList ;
class GALGAS_configSettingList_2E_element ;
class GALGAS_constantDefinitionList ;
class GALGAS_constantDefinitionList_2E_element ;
class GALGAS_constantMap ;
class GALGAS_constantMap_2E_element ;
class GALGAS_data ;
class GALGAS_dataList ;
class GALGAS_dataList_2E_element ;
class GALGAS_dataMap ;
class GALGAS_dataMap_2E_element ;
class GALGAS_declarationInRam ;
class GALGAS_declarationInRamList ;
class GALGAS_declarationInRamList_2E_element ;
class GALGAS_declaredByteMap ;
class GALGAS_declaredByteMap_2E_element ;
class GALGAS_declaredRoutineMap ;
class GALGAS_declaredRoutineMap_2E_element ;
class GALGAS_double ;
class GALGAS_exitBlockTerminationForBlockInstruction ;
class GALGAS_fieldSettingMap ;
class GALGAS_fieldSettingMap_2E_element ;
class GALGAS_filewrapper ;
class GALGAS_function ;
class GALGAS_functionlist ;
class GALGAS_functionlist_2E_element ;
class GALGAS_gotoTerminationForBlockInstruction ;
class GALGAS_if_5F_semi_5F_colon_5F_op ;
class GALGAS_illegalMaskList ;
class GALGAS_illegalMaskList_2E_element ;
class GALGAS_immediatAdd ;
class GALGAS_immediatAnd ;
class GALGAS_immediatComplement ;
class GALGAS_immediatDiv ;
class GALGAS_immediatEqualTest ;
class GALGAS_immediatExpression ;
class GALGAS_immediatExpressionList ;
class GALGAS_immediatExpressionList_2E_element ;
class GALGAS_immediatGreaterOrEqualTest ;
class GALGAS_immediatGreaterTest ;
class GALGAS_immediatInteger ;
class GALGAS_immediatLeftShift ;
class GALGAS_immediatLowerOrEqualTest ;
class GALGAS_immediatLowerTest ;
class GALGAS_immediatMod ;
class GALGAS_immediatMul ;
class GALGAS_immediatNegate ;
class GALGAS_immediatNotEqualTest ;
class GALGAS_immediatOr ;
class GALGAS_immediatRegister ;
class GALGAS_immediatRightShift ;
class GALGAS_immediatSlice ;
class GALGAS_immediatSliceExpressionList ;
class GALGAS_immediatSliceExpressionList_2E_element ;
class GALGAS_immediatSub ;
class GALGAS_immediatXor ;
class GALGAS_ipic_31__38_AbstractBlockTerminator ;
class GALGAS_ipic_31__38_AbstractConditionTerminator ;
class GALGAS_ipic_31__38_Block ;
class GALGAS_ipic_31__38_BlockList ;
class GALGAS_ipic_31__38_BlockList_2E_element ;
class GALGAS_ipic_31__38_ComputedBraTerminator ;
class GALGAS_ipic_31__38_ComputedGotoTerminator ;
class GALGAS_ipic_31__38_ComputedRETLWTerminator ;
class GALGAS_ipic_31__38_ConditionalJumpTerminator ;
class GALGAS_ipic_31__38_IncDecRegisterTerminator ;
class GALGAS_ipic_31__38_InstructionWithNoOperand ;
class GALGAS_ipic_31__38_JumpTerminator ;
class GALGAS_ipic_31__38_RegisterComparison ;
class GALGAS_ipic_31__38_RetfieTerminator ;
class GALGAS_ipic_31__38_RetlwTerminator ;
class GALGAS_ipic_31__38_ReturnTerminator ;
class GALGAS_ipic_31__38_SequentialInstruction ;
class GALGAS_ipic_31__38_SequentialInstructionList ;
class GALGAS_ipic_31__38_SequentialInstructionList_2E_element ;
class GALGAS_ipic_31__38_SingleInstructionTerminator ;
class GALGAS_ipic_31__38__5F_compare_5F_register_5F_instruction_5F_base_5F_code ;
class GALGAS_ipic_31__38__5F_condition_5F_skip_5F_instruction ;
class GALGAS_ipic_31__38__5F_intermediate_5F_JSR ;
class GALGAS_ipic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_BLANK ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_FA ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_FBA ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_FDA ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_FNOP ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_LFSR ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_MNOP ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_MOVFF ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_MOVLB ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_TBLRD ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_TBLWT ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall ;
class GALGAS_ipic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ;
class GALGAS_ipic_31__38__5F_intermediate_5F_registerExpression ;
class GALGAS_ipic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication ;
class GALGAS_ipic_31__38__5F_skip_5F_instruction_5F_BitTestSkip ;
class GALGAS_ipic_31__38__5F_skip_5F_instruction_5F_FDA ;
class GALGAS_ipic_31__38__5F_skip_5F_instruction_5F_compare_5F_register ;
class GALGAS_jumpInstructionKind ;
class GALGAS_lbool ;
class GALGAS_lchar ;
class GALGAS_ldouble ;
class GALGAS_literal_5F_instruction_5F_opcode ;
class GALGAS_location ;
class GALGAS_lsint ;
class GALGAS_lsint_36__34_ ;
class GALGAS_lstring ;
class GALGAS_lstringlist ;
class GALGAS_lstringlist_2E_element ;
class GALGAS_luint ;
class GALGAS_luint_36__34_ ;
class GALGAS_luintlist ;
class GALGAS_luintlist_2E_element ;
class GALGAS_neededConversionForClusterOrder ;
class GALGAS_neededConversionForClusterOrder_2E_element ;
class GALGAS_object ;
class GALGAS_objectlist ;
class GALGAS_objectlist_2E_element ;
class GALGAS_optimizeFlagStruct ;
class GALGAS_pic_31__38_AST ;
class GALGAS_pic_31__38_AbstractCaseItem ;
class GALGAS_pic_31__38_AndCondition ;
class GALGAS_pic_31__38_BccInStructuredCondition ;
class GALGAS_pic_31__38_BitTestInStructuredCondition ;
class GALGAS_pic_31__38_BitTestTerminator ;
class GALGAS_pic_31__38_BlockInstructionBlockList ;
class GALGAS_pic_31__38_BlockInstructionBlockList_2E_element ;
class GALGAS_pic_31__38_CaseExpressionList ;
class GALGAS_pic_31__38_CaseExpressionList_2E_element ;
class GALGAS_pic_31__38_ConditionExpression ;
class GALGAS_pic_31__38_DoWhilePartList ;
class GALGAS_pic_31__38_DoWhilePartList_2E_element ;
class GALGAS_pic_31__38_IncDecRegisterInCondition ;
class GALGAS_pic_31__38_InstructionList ;
class GALGAS_pic_31__38_InstructionList_2E_element ;
class GALGAS_pic_31__38_InstructionWithNoOperandKind ;
class GALGAS_pic_31__38_Instruction_5F_FA ;
class GALGAS_pic_31__38_Instruction_5F_FBA ;
class GALGAS_pic_31__38_Instruction_5F_FDA ;
class GALGAS_pic_31__38_Instruction_5F_FDA_5F_base_5F_code_5F_AST ;
class GALGAS_pic_31__38_Instruction_5F_FOREVER ;
class GALGAS_pic_31__38_Instruction_5F_IF_5F_BitTest ;
class GALGAS_pic_31__38_Instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON ;
class GALGAS_pic_31__38_Instruction_5F_IF_5F_IncDec ;
class GALGAS_pic_31__38_Instruction_5F_IF_5F_SEMI_5F_COLON ;
class GALGAS_pic_31__38_Instruction_5F_JSR ;
class GALGAS_pic_31__38_Instruction_5F_JUMP ;
class GALGAS_pic_31__38_Instruction_5F_JUMPCC ;
class GALGAS_pic_31__38_Instruction_5F_LDATAPTR ;
class GALGAS_pic_31__38_Instruction_5F_LFSR ;
class GALGAS_pic_31__38_Instruction_5F_LTBLPTR ;
class GALGAS_pic_31__38_Instruction_5F_MNOP ;
class GALGAS_pic_31__38_Instruction_5F_MOVFF ;
class GALGAS_pic_31__38_Instruction_5F_TBLRD ;
class GALGAS_pic_31__38_Instruction_5F_TBLWT ;
class GALGAS_pic_31__38_Instruction_5F_banksel ;
class GALGAS_pic_31__38_Instruction_5F_banksel_5F_register ;
class GALGAS_pic_31__38_Instruction_5F_block ;
class GALGAS_pic_31__38_Instruction_5F_checkbank ;
class GALGAS_pic_31__38_Instruction_5F_checknobank ;
class GALGAS_pic_31__38_Instruction_5F_computed_5F_bra ;
class GALGAS_pic_31__38_Instruction_5F_computed_5F_goto ;
class GALGAS_pic_31__38_Instruction_5F_computed_5F_rcall ;
class GALGAS_pic_31__38_Instruction_5F_computed_5F_retlw ;
class GALGAS_pic_31__38_Instruction_5F_do_5F_while ;
class GALGAS_pic_31__38_Instruction_5F_fnop ;
class GALGAS_pic_31__38_Instruction_5F_literalOperation ;
class GALGAS_pic_31__38_Instruction_5F_nobanksel ;
class GALGAS_pic_31__38_Instruction_5F_repetitionStatique ;
class GALGAS_pic_31__38_Instruction_5F_savebank ;
class GALGAS_pic_31__38_Instruction_5F_structured_5F_if ;
class GALGAS_pic_31__38_Instruction_5F_switch ;
class GALGAS_pic_31__38_Instruction_5F_withNoOperand ;
class GALGAS_pic_31__38_InterruptDefinitionList ;
class GALGAS_pic_31__38_InterruptDefinitionList_2E_element ;
class GALGAS_pic_31__38_IntervalCaseItem ;
class GALGAS_pic_31__38_NegateCondition ;
class GALGAS_pic_31__38_PiccoloInstruction ;
class GALGAS_pic_31__38_PiccoloSimpleInstruction ;
class GALGAS_pic_31__38_RegisterComparison ;
class GALGAS_pic_31__38_RegisterComparisonCondition ;
class GALGAS_pic_31__38_RegisterComparisonTerminator ;
class GALGAS_pic_31__38_RegisterTestCondition ;
class GALGAS_pic_31__38_RoutineDefinitionList ;
class GALGAS_pic_31__38_RoutineDefinitionList_2E_element ;
class GALGAS_pic_31__38_SimpleConstantCaseItem ;
class GALGAS_pic_31__38_SwitchInstructionCaseList ;
class GALGAS_pic_31__38_SwitchInstructionCaseList_2E_element ;
class GALGAS_pic_31__38_TestRegisterTerminator ;
class GALGAS_pic_31__38__5F_dataAddressMap ;
class GALGAS_pic_31__38__5F_dataAddressMap_2E_element ;
class GALGAS_pic_31__38__5F_dataMap ;
class GALGAS_pic_31__38__5F_dataMap_2E_element ;
class GALGAS_piccoloDeviceModel ;
class GALGAS_processorType ;
class GALGAS_programKind ;
class GALGAS_ramBankTable ;
class GALGAS_ramBankTable_2E_element ;
class GALGAS_ramDefinitionList ;
class GALGAS_ramDefinitionList_2E_element ;
class GALGAS_range ;
class GALGAS_registerExpression ;
class GALGAS_registerTable ;
class GALGAS_registerTable_2E_element ;
class GALGAS_routineCallMap ;
class GALGAS_routineCallMap_2E_element ;
class GALGAS_routineDeclarationList ;
class GALGAS_routineDeclarationList_2E_element ;
class GALGAS_routineKind ;
class GALGAS_routineMap ;
class GALGAS_routineMap_2E_element ;
class GALGAS_routineStackRequirementMap ;
class GALGAS_routineStackRequirementMap_2E_element ;
class GALGAS_sint ;
class GALGAS_sint_36__34_ ;
class GALGAS_skip_5F_instruction_5F_FDA_5F_base_5F_code ;
class GALGAS_string ;
class GALGAS_stringlist ;
class GALGAS_stringlist_2E_element ;
class GALGAS_stringset ;
class GALGAS_symbolTableForBlockOptimization ;
class GALGAS_symbolTableForBlockOptimization_2E_element ;
class GALGAS_symbolTableForClusterOrdering ;
class GALGAS_symbolTableForClusterOrdering_2E_element ;
class GALGAS_symbolTableForOptimizations ;
class GALGAS_symbolTableForOptimizations_2E_element ;
class GALGAS_symbolTableForRelativesResolution ;
class GALGAS_symbolTableForRelativesResolution_2E_element ;
class GALGAS_tableAccessOption ;
class GALGAS_testTerminationForBlockInstruction ;
class GALGAS_type ;
class GALGAS_typelist ;
class GALGAS_typelist_2E_element ;
class GALGAS_uint ;
class GALGAS_uint_36__34_ ;
class GALGAS_uint_36__34_list ;
class GALGAS_uint_36__34_list_2E_element ;
class GALGAS_uintlist ;
class GALGAS_uintlist_2E_element ;

//-----------------------------------------------------------------------------*
//                                                                             *
//                Parser class 'pic18_start_symbol' declaration                *
//                                                                             *
//-----------------------------------------------------------------------------*

class cParser_pic_31__38__5F_start_5F_symbol {
//--- Virtual destructor
  public : virtual ~ cParser_pic_31__38__5F_start_5F_symbol (void) {}

//--- Non terminal declarations
  protected : virtual void nt_body_ (GALGAS_pic_31__38_InterruptDefinitionList & ioArgument0,
                                     GALGAS_pic_31__38_RoutineDefinitionList & ioArgument1,
                                     GALGAS_lstringlist & ioArgument2,
                                     GALGAS_lstringlist & ioArgument3,
                                     GALGAS_ramDefinitionList & ioArgument4,
                                     GALGAS_lstringlist & ioArgument5,
                                     GALGAS_configDefinitionList & ioArgument6,
                                     GALGAS_constantDefinitionList & ioArgument7,
                                     GALGAS_checkpicList & ioArgument8,
                                     GALGAS_dataList & ioArgument9,
                                     GALGAS_bool & ioArgument10,
                                     GALGAS_bool & ioArgument11,
                                     C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_body_parse (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_body_indexing (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_start_5F_symbol_ (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_start_5F_symbol_importBootloaderSpecification (GALGAS_piccoloDeviceModel & outArgument0,
                                                                             GALGAS_string & outArgument1,
                                                                             GALGAS_uint & outArgument2,
                                                                             GALGAS_ramBankTable & outArgument3,
                                                                             GALGAS_registerTable & outArgument4,
                                                                             GALGAS_bootloaderReservedRAMmap & outArgument5,
                                                                             GALGAS_routineDeclarationList & outArgument6,
                                                                             GALGAS_routineDeclarationList & outArgument7,
                                                                             GALGAS_luint & outArgument8,
                                                                             C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_start_5F_symbol_parse (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;

  protected : virtual void nt_start_5F_symbol_indexing (C_Lexique_piccolo_5F_lexique * inLexique) = 0 ;


//--- Rule declarations
  protected : void rule_pic_31__38__5F_start_5F_symbol_start_5F_symbol_i0_ (C_Lexique_piccolo_5F_lexique * inLexique) ;

  protected : void rule_pic_31__38__5F_start_5F_symbol_start_5F_symbol_i0_importBootloaderSpecification (GALGAS_piccoloDeviceModel & outArgument0,
                                                                                                         GALGAS_string & outArgument1,
                                                                                                         GALGAS_uint & outArgument2,
                                                                                                         GALGAS_ramBankTable & outArgument3,
                                                                                                         GALGAS_registerTable & outArgument4,
                                                                                                         GALGAS_bootloaderReservedRAMmap & outArgument5,
                                                                                                         GALGAS_routineDeclarationList & outArgument6,
                                                                                                         GALGAS_routineDeclarationList & outArgument7,
                                                                                                         GALGAS_luint & outArgument8,
                                                                                                         C_Lexique_piccolo_5F_lexique * inLexique) ;

  protected : void rule_pic_31__38__5F_start_5F_symbol_start_5F_symbol_i0_parse (C_Lexique_piccolo_5F_lexique * inLexique) ;

  protected : void rule_pic_31__38__5F_start_5F_symbol_start_5F_symbol_i0_indexing (C_Lexique_piccolo_5F_lexique * inLexique) ;



//--- Select methods
  protected : virtual int32_t select_pic_31__38__5F_start_5F_symbol_0 (C_Lexique_piccolo_5F_lexique *) = 0 ;


} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
